/* 
  Localizable.strings (English)
  CleanMacForFlutters
*/

// MARK: - Home View
"home.title" = "Clean Mac for Flutter";
"home.select_folders" = "Select folders";
"home.empty_folders_message" = "Select one or more folders to display.";
"home.run_clean" = "Run clean";
"home.clean_build_index" = "Clean build & index";
"home.github" = "Github";
"home.support" = "Support";

// MARK: - Full Disk Access
"fda.required_title" = "Full Disk Access Required";
"fda.required_description" = "For the app to work correctly and be able to clean project folders, grant Full Disk Access in System Settings.";
"fda.open_settings" = "Open Privacy Settings";
"fda.try_again" = "Try again";
"fda.checking_permissions" = "Checking permissions…";
"fda.instructions" = "Path: System Settings > Privacy & Security > Full Disk Access\nAdd your app to the list and mark it as active.";

// MARK: - Commands
"commands.executing" = "Executing commands...";
"commands.processing_folder" = "Processing: %@";
"clean.no.activated" = "No folders to clean";

// MARK: - Alerts
"alert.error" = "Error";
"alert.success" = "Success";
"alert.ok" = "OK";

// MARK: - Icons/Labels
"icon.folder" = "folder";
"icon.lock" = "lock";

// MARK: - Clean Commands
"clean.no.activated" = "No activated folders to clean";
"clean.completed.title" = "Cleaning completed!";
"clean.completed.summary" = "✅ Folders deleted: %d";
"clean.completed.space" = "💾 Space freed: %@";
"clean.completed.warnings" = "⚠️ Warnings: %d";
"clean.none.deleted.errors" = "No folders were deleted, but %d errors occurred.";
"clean.nothing.found" = "No folders to clean were found.";

// MARK: - Build & Index Clean
"build.index.processing" = "Cleaning DerivedData and Index...";
"build.index.completed.title" = "Build data and index removed!";
"build.index.nothing.found" = "No build data or index found.";
"build.index.select.confirm" = "Confirm";
"build.index.select.message" = "Select the Xcode folder to clean DerivedData and Index.\nDefault path: ~/Library/Developer/Xcode";
"build.index.confirm.title" = "Confirm cleanup";
"build.index.confirm.message" = "Do you want to delete Xcode build data and project index?\n\nSpace to be freed: %@";
"build.index.confirm.delete" = "Delete";
"build.index.confirm.cancel" = "Cancel";
